<a href="https://colab.research.google.com/github/Midhilesh4890/Pandas/blob/main/Pandas_w3resource_Aggregating_%26_Grouping.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.DataFrame({
    'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14     151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12     159      32  street4

In [2]:
df1 = df.groupby('school')
df1.apply(display)
# for name,group in df1:
#     print(name)
#     print(group)

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1

   school class          name date_Of_Birth   age  height  weight  address
S2   s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5   s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

   school class         name date_Of_Birth   age  height  weight  address
S3   s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

   school class          name date_Of_Birth   age  height  weight  address
S6   s004    VI  David Parkes     15/09/1997   12     159      32  street4

Empty DataFrame
Columns: []
Index: []

In [3]:
df.groupby('school').agg({'age':['mean','min','max']})

         age
        mean min max
school
s001    12.5  12  13
s002    13.0  12  14
s003    13.0  13  13
s004    12.0  12  12

In [4]:
df.groupby('school').agg(Mean=('age','mean'),Max=('age','max'),Min=('age','min'))

        Mean  Max  Min
school
s001    12.5   13   12
s002    13.0   14   12
s003    13.0   13   13
s004    12.0   12   12

In [5]:
df.groupby('school').agg({'age': [("Mean","mean"), ("Min", "min"), ("Max","max")]})

         age
        Mean Min Max
school
s001    12.5  12  13
s002    13.0  12  14
s003    13.0  13  13
s004    12.0  12  12

In [6]:
df.groupby('school').describe()

         age                               ... weight
       count  mean       std   min    25%  ...    min    25%   50%    75%   max
school                                     ...
s001     2.0  12.5  0.707107  12.0  12.25  ...   30.0  31.25  32.5  33.75  35.0
s002     2.0  13.0  1.414214  12.0  12.50  ...   31.0  31.25  31.5  31.75  32.0
s003     1.0  13.0       NaN  13.0  13.00  ...   33.0  33.00  33.0  33.00  33.0
s004     1.0  12.0       NaN  12.0  12.00  ...   32.0  32.00  32.0  32.00  32.0

[4 rows x 24 columns]

In [7]:
df.groupby(['school','class']).apply(display)

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1

   school class          name date_Of_Birth   age  height  weight  address
S4   s001    VI  Eesha Hinton     25/09/1998   13     167      30  street1

   school class          name date_Of_Birth   age  height  weight  address
S2   s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5   s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

   school class         name date_Of_Birth   age  height  weight  address
S3   s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

   school class          name date_Of_Birth   age  height  weight  address
S6   s004    VI  David Parkes     15/09/1997   12     159      32  street4

Empty DataFrame
Columns: []
Index: []

In [8]:
grouped = df.groupby(['school','class'])
grouped.size()

school  class
s001    V        1
        VI       1
s002    V        2
s003    VI       1
s004    VI       1
dtype: int64

In [9]:
specific_group = df.groupby('school')
specific_group.get_group('s001')

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1

In [10]:
df.groupby('school').groups.keys()

dict_keys(['s001', 's002', 's003', 's004'])

In [11]:
import pandas as pd
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [12]:
df.groupby('customer_id').agg({'purch_amt':['mean','min','max']})

               purch_amt
                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

In [13]:
df.groupby('salesman_id')['ord_date'].min()

salesman_id
5001    2012-04-25
5002    2012-06-27
5003    2012-08-17
5005    2012-09-10
5006    2012-10-10
5007    2012-08-17
Name: ord_date, dtype: object

In [14]:
df.groupby('salesman_id')['ord_date'].apply(min)

salesman_id
5001    2012-04-25
5002    2012-06-27
5003    2012-08-17
5005    2012-09-10
5006    2012-10-10
5007    2012-08-17
Name: ord_date, dtype: object

In [15]:
df.groupby(['customer_id','salesman_id']).size()
df.groupby(['salesman_id','customer_id']).size()

salesman_id  customer_id
5001         3002           3
             3007           1
5002         3005           2
             3008           1
5003         3009           2
5005         3001           1
5006         3004           1
5007         3003           1
dtype: int64

In [16]:
df.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum}).sort_values('purch_amt',ascending=False)

                         purch_amt
customer_id salesman_id
3002        5001           8870.86
3009        5003           2590.90
3007        5001           2400.60
3004        5006           1983.43
3005        5002           1099.00
3001        5005            270.65
3008        5002            250.45
3003        5007             75.29

In [17]:
df.groupby('customer_id')['ord_date'].apply(list)

customer_id
3001                            [2012-09-10]
3002    [2012-10-05, 2012-09-10, 2012-04-25]
3003                            [2012-08-17]
3004                            [2012-10-10]
3005                [2012-10-05, 2012-09-10]
3007                            [2012-07-27]
3008                            [2012-06-27]
3009                [2012-08-17, 2012-10-10]
Name: ord_date, dtype: object

In [18]:
df['ord_date']= pd.to_datetime(df['ord_date']) 
df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

In [19]:
df.set_index('ord_date').groupby(pd.Grouper(freq='Q')).agg({'purch_amt':'sum'})

            purch_amt
ord_date
2012-06-30    3296.05
2012-09-30    9565.54
2012-12-31    4679.59

In [20]:
df.groupby([df['ord_date'].dt.year, df['ord_date'].dt.month]).agg({'purch_amt':sum})

                   purch_amt
ord_date ord_date
2012     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59

In [21]:
import pandas as pd
df = pd.DataFrame( {'X' : [10, 10, 10, 20, 30, 30, 10], 
                    'Y' : [10, 15, 11, 20, 21, 12, 14], 
                    'Z' : [22, 20, 18, 20, 13, 10, 0]})

In [22]:
df.groupby('X').aggregate(lambda x:x.unique().tolist())

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [21, 12]         [13, 10]

In [23]:
df.groupby('X').agg(Y = ('Y', lambda x:x.unique().tolist()),Z = ('Z', lambda x:x.unique().tolist()))

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [21, 12]         [13, 10]

In [24]:
import pandas as pd
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})

df.groupby('value')['id'].nunique()

value
a    3
b    2
Name: id, dtype: int64

In [25]:
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001],
'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6],
'sale_feb':[250.5, 170.65, 15.26, 110.5, 598.5, 1400.6, 2760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_mar':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_apr':[150.5, 270.65, 95.26, 210.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_may':[130.5, 270.65, 65.26, 310.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jun':[150.5, 270.65, 45.26, 110.5, 948.5, 3400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_jul':[950.5, 270.65, 65.26, 210.5, 948.5, 2400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_aug':[150.5, 70.65,  65.26, 110.5, 948.5, 400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_sep':[150.5, 270.65, 65.26, 110.5, 948.5, 200.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_oct':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'sale_nov':[150.5, 270.65, 95.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6], 
'sale_dec':[150.5, 70.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6]
})

df = df.groupby('salesman_id').agg(lambda x : x.sum() if x.name in ['sale_jan','sale_feb','sale_mar'] else x.mean())
df

,sale_jan,sale_feb,sale_mar,sale_apr,sale_may,sale_jun,sale_jul,sale_aug,sale_sep,sale_oct,sale_nov,sale_dec
salesman_id,,,,,,,,,,,,
5001,5271.46,7221.46,11271.46,1575.365000,1567.865,3062.865000,2817.865000,2317.865000,2267.865000,2817.865000,2825.365000,2817.865000
5002,2349.45,1099.45,1349.45,449.816667,443.150,449.816667,716.483333,449.816667,449.816667,449.816667,449.816667,449.816667
5003,590.90,2590.90,2590.90,1345.450000,1395.450,1295.450000,1345.450000,1295.450000,1295.450000,1295.450000,1295.450000,1295.450000
5005,270.65,170.65,270.65,270.650000,270.650,270.650000,270.650000,70.650000,270.650000,270.650000,270.650000,70.650000
5006,2983.43,1983.43,1983.43,1983.430000,1983.430,983.430000,983.430000,1983.430000,1983.430000,1983.430000,1983.430000,1983.430000
5007,75.29,75.29,75.29,75.290000,75.290,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000

In [26]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
df = pd.DataFrame({
    'student_id': ['S001','S001','S002','S002','S003','S003'],
    'marks': [[88,89,90],[78,81,60],[84,83,91],[84,88,91],[90,89,92],[88,59,90]]})

result = df.set_index('student_id')['marks'].groupby('student_id').apply(list).apply(lambda x:np.mean(x,0))
result

student_id
S001    [83.0, 85.0, 75.0]
S002    [84.0, 85.5, 91.0]
S003    [89.0, 74.0, 91.0]
Name: marks, dtype: object

In [27]:
df.groupby('student_id')['marks'].apply(list).apply(lambda x:np.mean(x,0))

student_id
S001    [83.0, 85.0, 75.0]
S002    [84.0, 85.5, 91.0]
S003    [89.0, 74.0, 91.0]
Name: marks, dtype: object

In [28]:
df.groupby('student_id')['marks'].apply(list).apply(lambda x:np.mean(x,1))

student_id
S001                 [89.0, 73.0]
S002    [86.0, 87.66666666666667]
S003    [90.33333333333333, 79.0]
Name: marks, dtype: object

In [29]:
df.groupby('student_id')['marks'].apply(list).apply(lambda x:np.mean(x))

student_id
S001    81.000000
S002    86.833333
S003    84.666667
Name: marks, dtype: float64